GopalSaraf/Practicals/PSDL/include/proc/pic16lf18854.inc
// Register: SMT2CPRH
#define SMT2CPRH SMT2CPRH
SMT2CPRH                                 equ 0510h
// bitfield definitions
SMT2CPRH_CPR_POSN                        equ 0000h
SMT2CPRH_CPR_POSITION                    equ 0000h
SMT2CPRH_CPR_SIZE                        equ 0008h
SMT2CPRH_CPR_LENGTH                      equ 0008h
SMT2CPRH_CPR_MASK                        equ 00FFh
SMT2CPRH_CPR8_POSN                       equ 0000h
SMT2CPRH_CPR8_POSITION                   equ 0000h
SMT2CPRH_CPR8_SIZE                       equ 0001h
SMT2CPRH_CPR8_LENGTH                     equ 0001h
SMT2CPRH_CPR8_MASK                       equ 0001h
SMT2CPRH_CPR9_POSN                       equ 0001h
SMT2CPRH_CPR9_POSITION                   equ 0001h
SMT2CPRH_CPR9_SIZE                       equ 0001h
SMT2CPRH_CPR9_LENGTH                     equ 0001h
SMT2CPRH_CPR9_MASK                       equ 0002h
SMT2CPRH_CPR10_POSN                      equ 0002h
SMT2CPRH_CPR10_POSITION                  equ 0002h
SMT2CPRH_CPR10_SIZE                      equ 0001h
SMT2CPRH_CPR10_LENGTH                    equ 0001h
SMT2CPRH_CPR10_MASK                      equ 0004h
SMT2CPRH_CPR11_POSN                      equ 0003h
SMT2CPRH_CPR11_POSITION                  equ 0003h
SMT2CPRH_CPR11_SIZE                      equ 0001h
SMT2CPRH_CPR11_LENGTH                    equ 0001h
SMT2CPRH_CPR11_MASK                      equ 0008h
SMT2CPRH_CPR12_POSN                      equ 0004h
SMT2CPRH_CPR12_POSITION                  equ 0004h
SMT2CPRH_CPR12_SIZE                      equ 0001h
SMT2CPRH_CPR12_LENGTH                    equ 0001h
SMT2CPRH_CPR12_MASK                      equ 0010h
SMT2CPRH_CPR13_POSN                      equ 0005h
SMT2CPRH_CPR13_POSITION                  equ 0005h
SMT2CPRH_CPR13_SIZE                      equ 0001h
SMT2CPRH_CPR13_LENGTH                    equ 0001h
SMT2CPRH_CPR13_MASK                      equ 0020h
SMT2CPRH_CPR14_POSN                      equ 0006h
SMT2CPRH_CPR14_POSITION                  equ 0006h
SMT2CPRH_CPR14_SIZE                      equ 0001h
SMT2CPRH_CPR14_LENGTH                    equ 0001h
SMT2CPRH_CPR14_MASK                      equ 0040h
SMT2CPRH_CPR15_POSN                      equ 0007h
SMT2CPRH_CPR15_POSITION                  equ 0007h
SMT2CPRH_CPR15_SIZE                      equ 0001h
SMT2CPRH_CPR15_LENGTH                    equ 0001h
SMT2CPRH_CPR15_MASK                      equ 0080h
SMT2CPRH_SMT2CPR8_POSN                   equ 0000h
SMT2CPRH_SMT2CPR8_POSITION               equ 0000h
SMT2CPRH_SMT2CPR8_SIZE                   equ 0001h
SMT2CPRH_SMT2CPR8_LENGTH                 equ 0001h
SMT2CPRH_SMT2CPR8_MASK                   equ 0001h
SMT2CPRH_SMT2CPR9_POSN                   equ 0001h
SMT2CPRH_SMT2CPR9_POSITION               equ 0001h
SMT2CPRH_SMT2CPR9_SIZE                   equ 0001h
SMT2CPRH_SMT2CPR9_LENGTH                 equ 0001h
SMT2CPRH_SMT2CPR9_MASK                   equ 0002h
SMT2CPRH_SMT2CPR10_POSN                  equ 0002h
SMT2CPRH_SMT2CPR10_POSITION              equ 0002h
SMT2CPRH_SMT2CPR10_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR10_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR10_MASK                  equ 0004h
SMT2CPRH_SMT2CPR11_POSN                  equ 0003h
SMT2CPRH_SMT2CPR11_POSITION              equ 0003h
SMT2CPRH_SMT2CPR11_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR11_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR11_MASK                  equ 0008h
SMT2CPRH_SMT2CPR12_POSN                  equ 0004h
SMT2CPRH_SMT2CPR12_POSITION              equ 0004h
SMT2CPRH_SMT2CPR12_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR12_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR12_MASK                  equ 0010h
SMT2CPRH_SMT2CPR13_POSN                  equ 0005h
SMT2CPRH_SMT2CPR13_POSITION              equ 0005h
SMT2CPRH_SMT2CPR13_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR13_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR13_MASK                  equ 0020h
SMT2CPRH_SMT2CPR14_POSN                  equ 0006h
SMT2CPRH_SMT2CPR14_POSITION              equ 0006h
SMT2CPRH_SMT2CPR14_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR14_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR14_MASK                  equ 0040h
SMT2CPRH_SMT2CPR15_POSN                  equ 0007h
SMT2CPRH_SMT2CPR15_POSITION              equ 0007h
SMT2CPRH_SMT2CPR15_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR15_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR15_MASK                  equ 0080h
SMT2CPRH_SMT2CPR_POSN                    equ 0000h
SMT2CPRH_SMT2CPR_POSITION                equ 0000h
SMT2CPRH_SMT2CPR_SIZE                    equ 0008h
SMT2CPRH_SMT2CPR_LENGTH                  equ 0008h
SMT2CPRH_SMT2CPR_MASK                    equ 00FFh

// Register: SMT2CPRU
#define SMT2CPRU SMT2CPRU
SMT2CPRU                                 equ 0511h
// bitfield definitions
SMT2CPRU_CPR_POSN                        equ 0000h
SMT2CPRU_CPR_POSITION                    equ 0000h
SMT2CPRU_CPR_SIZE                        equ 0008h
SMT2CPRU_CPR_LENGTH                      equ 0008h
SMT2CPRU_CPR_MASK                        equ 00FFh
SMT2CPRU_CPR16_POSN                      equ 0000h
SMT2CPRU_CPR16_POSITION                  equ 0000h
SMT2CPRU_CPR16_SIZE                      equ 0001h
SMT2CPRU_CPR16_LENGTH                    equ 0001h
SMT2CPRU_CPR16_MASK                      equ 0001h
SMT2CPRU_CPR17_POSN                      equ 0001h
SMT2CPRU_CPR17_POSITION                  equ 0001h
SMT2CPRU_CPR17_SIZE                      equ 0001h
SMT2CPRU_CPR17_LENGTH                    equ 0001h
SMT2CPRU_CPR17_MASK                      equ 0002h
SMT2CPRU_CPR18_POSN                      equ 0002h
SMT2CPRU_CPR18_POSITION                  equ 0002h
SMT2CPRU_CPR18_SIZE                      equ 0001h
SMT2CPRU_CPR18_LENGTH                    equ 0001h
SMT2CPRU_CPR18_MASK                      equ 0004h
SMT2CPRU_CPR19_POSN                      equ 0003h
SMT2CPRU_CPR19_POSITION                  equ 0003h
SMT2CPRU_CPR19_SIZE                      equ 0001h
SMT2CPRU_CPR19_LENGTH                    equ 0001h
SMT2CPRU_CPR19_MASK                      equ 0008h
SMT2CPRU_CPR20_POSN                      equ 0004h
SMT2CPRU_CPR20_POSITION                  equ 0004h
SMT2CPRU_CPR20_SIZE                      equ 0001h
SMT2CPRU_CPR20_LENGTH                    equ 0001h
SMT2CPRU_CPR20_MASK                      equ 0010h
SMT2CPRU_CPR21_POSN                      equ 0005h
SMT2CPRU_CPR21_POSITION                  equ 0005h
SMT2CPRU_CPR21_SIZE                      equ 0001h
SMT2CPRU_CPR21_LENGTH                    equ 0001h
SMT2CPRU_CPR21_MASK                      equ 0020h
SMT2CPRU_CPR22_POSN                      equ 0006h
SMT2CPRU_CPR22_POSITION                  equ 0006h
SMT2CPRU_CPR22_SIZE                      equ 0001h
SMT2CPRU_CPR22_LENGTH                    equ 0001h
SMT2CPRU_CPR22_MASK                      equ 0040h
SMT2CPRU_CPR23_POSN                      equ 0007h
SMT2CPRU_CPR23_POSITION                  equ 0007h
SMT2CPRU_CPR23_SIZE                      equ 0001h
SMT2CPRU_CPR23_LENGTH                    equ 0001h
SMT2CPRU_CPR23_MASK                      equ 0080h
SMT2CPRU_SMT2CPR16_POSN                  equ 0000h
SMT2CPRU_SMT2CPR16_POSITION              equ 0000h
SMT2CPRU_SMT2CPR16_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR16_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR16_MASK                  equ 0001h
SMT2CPRU_SMT2CPR17_POSN                  equ 0001h
SMT2CPRU_SMT2CPR17_POSITION              equ 0001h
SMT2CPRU_SMT2CPR17_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR17_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR17_MASK                  equ 0002h
SMT2CPRU_SMT2CPR18_POSN                  equ 0002h
SMT2CPRU_SMT2CPR18_POSITION              equ 0002h
SMT2CPRU_SMT2CPR18_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR18_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR18_MASK                  equ 0004h
SMT2CPRU_SMT2CPR19_POSN                  equ 0003h
SMT2CPRU_SMT2CPR19_POSITION              equ 0003h
SMT2CPRU_SMT2CPR19_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR19_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR19_MASK                  equ 0008h
SMT2CPRU_SMT2CPR20_POSN                  equ 0004h
SMT2CPRU_SMT2CPR20_POSITION              equ 0004h
SMT2CPRU_SMT2CPR20_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR20_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR20_MASK                  equ 0010h
SMT2CPRU_SMT2CPR21_POSN                  equ 0005h
SMT2CPRU_SMT2CPR21_POSITION              equ 0005h
SMT2CPRU_SMT2CPR21_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR21_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR21_MASK                  equ 0020h
SMT2CPRU_SMT2CPR22_POSN                  equ 0006h
SMT2CPRU_SMT2CPR22_POSITION              equ 0006h
SMT2CPRU_SMT2CPR22_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR22_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR22_MASK                  equ 0040h
SMT2CPRU_SMT2CPR23_POSN                  equ 0007h
SMT2CPRU_SMT2CPR23_POSITION              equ 0007h
SMT2CPRU_SMT2CPR23_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR23_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR23_MASK                  equ 0080h
SMT2CPRU_SMT2CPR_POSN                    equ 0000h
SMT2CPRU_SMT2CPR_POSITION                equ 0000h
SMT2CPRU_SMT2CPR_SIZE                    equ 0008h
SMT2CPRU_SMT2CPR_LENGTH                  equ 0008h
SMT2CPRU_SMT2CPR_MASK                    equ 00FFh

