GopalSaraf/Practicals/PSDL/include/proc/pic16lf18854.inc
// Register: CLC2SEL1
#define CLC2SEL1 CLC2SEL1
CLC2SEL1                                 equ 0E1Dh
// bitfield definitions
CLC2SEL1_LC2D2S0_POSN                    equ 0000h
CLC2SEL1_LC2D2S0_POSITION                equ 0000h
CLC2SEL1_LC2D2S0_SIZE                    equ 0001h
CLC2SEL1_LC2D2S0_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S0_MASK                    equ 0001h
CLC2SEL1_LC2D2S1_POSN                    equ 0001h
CLC2SEL1_LC2D2S1_POSITION                equ 0001h
CLC2SEL1_LC2D2S1_SIZE                    equ 0001h
CLC2SEL1_LC2D2S1_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S1_MASK                    equ 0002h
CLC2SEL1_LC2D2S2_POSN                    equ 0002h
CLC2SEL1_LC2D2S2_POSITION                equ 0002h
CLC2SEL1_LC2D2S2_SIZE                    equ 0001h
CLC2SEL1_LC2D2S2_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S2_MASK                    equ 0004h
CLC2SEL1_LC2D2S3_POSN                    equ 0003h
CLC2SEL1_LC2D2S3_POSITION                equ 0003h
CLC2SEL1_LC2D2S3_SIZE                    equ 0001h
CLC2SEL1_LC2D2S3_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S3_MASK                    equ 0008h
CLC2SEL1_LC2D2S4_POSN                    equ 0004h
CLC2SEL1_LC2D2S4_POSITION                equ 0004h
CLC2SEL1_LC2D2S4_SIZE                    equ 0001h
CLC2SEL1_LC2D2S4_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S4_MASK                    equ 0010h
CLC2SEL1_LC2D2S5_POSN                    equ 0005h
CLC2SEL1_LC2D2S5_POSITION                equ 0005h
CLC2SEL1_LC2D2S5_SIZE                    equ 0001h
CLC2SEL1_LC2D2S5_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S5_MASK                    equ 0020h
CLC2SEL1_LC2D2S6_POSN                    equ 0006h
CLC2SEL1_LC2D2S6_POSITION                equ 0006h
CLC2SEL1_LC2D2S6_SIZE                    equ 0001h
CLC2SEL1_LC2D2S6_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S6_MASK                    equ 0040h
CLC2SEL1_LC2D2S7_POSN                    equ 0007h
CLC2SEL1_LC2D2S7_POSITION                equ 0007h
CLC2SEL1_LC2D2S7_SIZE                    equ 0001h
CLC2SEL1_LC2D2S7_LENGTH                  equ 0001h
CLC2SEL1_LC2D2S7_MASK                    equ 0080h
CLC2SEL1_LC2D2S_POSN                     equ 0000h
CLC2SEL1_LC2D2S_POSITION                 equ 0000h
CLC2SEL1_LC2D2S_SIZE                     equ 0008h
CLC2SEL1_LC2D2S_LENGTH                   equ 0008h
CLC2SEL1_LC2D2S_MASK                     equ 00FFh
CLC2SEL1_D2S_POSN                        equ 0000h
CLC2SEL1_D2S_POSITION                    equ 0000h
CLC2SEL1_D2S_SIZE                        equ 0008h
CLC2SEL1_D2S_LENGTH                      equ 0008h
CLC2SEL1_D2S_MASK                        equ 00FFh
CLC2SEL1_D2S0_POSN                       equ 0000h
CLC2SEL1_D2S0_POSITION                   equ 0000h
CLC2SEL1_D2S0_SIZE                       equ 0001h
CLC2SEL1_D2S0_LENGTH                     equ 0001h
CLC2SEL1_D2S0_MASK                       equ 0001h
CLC2SEL1_D2S1_POSN                       equ 0001h
CLC2SEL1_D2S1_POSITION                   equ 0001h
CLC2SEL1_D2S1_SIZE                       equ 0001h
CLC2SEL1_D2S1_LENGTH                     equ 0001h
CLC2SEL1_D2S1_MASK                       equ 0002h
CLC2SEL1_D2S2_POSN                       equ 0002h
CLC2SEL1_D2S2_POSITION                   equ 0002h
CLC2SEL1_D2S2_SIZE                       equ 0001h
CLC2SEL1_D2S2_LENGTH                     equ 0001h
CLC2SEL1_D2S2_MASK                       equ 0004h
CLC2SEL1_D2S3_POSN                       equ 0003h
CLC2SEL1_D2S3_POSITION                   equ 0003h
CLC2SEL1_D2S3_SIZE                       equ 0001h
CLC2SEL1_D2S3_LENGTH                     equ 0001h
CLC2SEL1_D2S3_MASK                       equ 0008h
CLC2SEL1_D2S4_POSN                       equ 0004h
CLC2SEL1_D2S4_POSITION                   equ 0004h
CLC2SEL1_D2S4_SIZE                       equ 0001h
CLC2SEL1_D2S4_LENGTH                     equ 0001h
CLC2SEL1_D2S4_MASK                       equ 0010h
CLC2SEL1_D2S5_POSN                       equ 0005h
CLC2SEL1_D2S5_POSITION                   equ 0005h
CLC2SEL1_D2S5_SIZE                       equ 0001h
CLC2SEL1_D2S5_LENGTH                     equ 0001h
CLC2SEL1_D2S5_MASK                       equ 0020h
CLC2SEL1_D2S6_POSN                       equ 0006h
CLC2SEL1_D2S6_POSITION                   equ 0006h
CLC2SEL1_D2S6_SIZE                       equ 0001h
CLC2SEL1_D2S6_LENGTH                     equ 0001h
CLC2SEL1_D2S6_MASK                       equ 0040h
CLC2SEL1_D2S7_POSN                       equ 0007h
CLC2SEL1_D2S7_POSITION                   equ 0007h
CLC2SEL1_D2S7_SIZE                       equ 0001h
CLC2SEL1_D2S7_LENGTH                     equ 0001h
CLC2SEL1_D2S7_MASK                       equ 0080h

// Register: CLC2SEL2
#define CLC2SEL2 CLC2SEL2
CLC2SEL2                                 equ 0E1Eh
// bitfield definitions
CLC2SEL2_LC2D3S0_POSN                    equ 0000h
CLC2SEL2_LC2D3S0_POSITION                equ 0000h
CLC2SEL2_LC2D3S0_SIZE                    equ 0001h
CLC2SEL2_LC2D3S0_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S0_MASK                    equ 0001h
CLC2SEL2_LC2D3S1_POSN                    equ 0001h
CLC2SEL2_LC2D3S1_POSITION                equ 0001h
CLC2SEL2_LC2D3S1_SIZE                    equ 0001h
CLC2SEL2_LC2D3S1_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S1_MASK                    equ 0002h
CLC2SEL2_LC2D3S2_POSN                    equ 0002h
CLC2SEL2_LC2D3S2_POSITION                equ 0002h
CLC2SEL2_LC2D3S2_SIZE                    equ 0001h
CLC2SEL2_LC2D3S2_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S2_MASK                    equ 0004h
CLC2SEL2_LC2D3S3_POSN                    equ 0003h
CLC2SEL2_LC2D3S3_POSITION                equ 0003h
CLC2SEL2_LC2D3S3_SIZE                    equ 0001h
CLC2SEL2_LC2D3S3_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S3_MASK                    equ 0008h
CLC2SEL2_LC2D3S4_POSN                    equ 0004h
CLC2SEL2_LC2D3S4_POSITION                equ 0004h
CLC2SEL2_LC2D3S4_SIZE                    equ 0001h
CLC2SEL2_LC2D3S4_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S4_MASK                    equ 0010h
CLC2SEL2_LC2D3S5_POSN                    equ 0005h
CLC2SEL2_LC2D3S5_POSITION                equ 0005h
CLC2SEL2_LC2D3S5_SIZE                    equ 0001h
CLC2SEL2_LC2D3S5_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S5_MASK                    equ 0020h
CLC2SEL2_LC2D3S6_POSN                    equ 0006h
CLC2SEL2_LC2D3S6_POSITION                equ 0006h
CLC2SEL2_LC2D3S6_SIZE                    equ 0001h
CLC2SEL2_LC2D3S6_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S6_MASK                    equ 0040h
CLC2SEL2_LC2D3S7_POSN                    equ 0007h
CLC2SEL2_LC2D3S7_POSITION                equ 0007h
CLC2SEL2_LC2D3S7_SIZE                    equ 0001h
CLC2SEL2_LC2D3S7_LENGTH                  equ 0001h
CLC2SEL2_LC2D3S7_MASK                    equ 0080h
CLC2SEL2_LC2D3S_POSN                     equ 0000h
CLC2SEL2_LC2D3S_POSITION                 equ 0000h
CLC2SEL2_LC2D3S_SIZE                     equ 0008h
CLC2SEL2_LC2D3S_LENGTH                   equ 0008h
CLC2SEL2_LC2D3S_MASK                     equ 00FFh
CLC2SEL2_D3S_POSN                        equ 0000h
CLC2SEL2_D3S_POSITION                    equ 0000h
CLC2SEL2_D3S_SIZE                        equ 0008h
CLC2SEL2_D3S_LENGTH                      equ 0008h
CLC2SEL2_D3S_MASK                        equ 00FFh
CLC2SEL2_D3S0_POSN                       equ 0000h
CLC2SEL2_D3S0_POSITION                   equ 0000h
CLC2SEL2_D3S0_SIZE                       equ 0001h
CLC2SEL2_D3S0_LENGTH                     equ 0001h
CLC2SEL2_D3S0_MASK                       equ 0001h
CLC2SEL2_D3S1_POSN                       equ 0001h
CLC2SEL2_D3S1_POSITION                   equ 0001h
CLC2SEL2_D3S1_SIZE                       equ 0001h
CLC2SEL2_D3S1_LENGTH                     equ 0001h
CLC2SEL2_D3S1_MASK                       equ 0002h
CLC2SEL2_D3S2_POSN                       equ 0002h
CLC2SEL2_D3S2_POSITION                   equ 0002h
CLC2SEL2_D3S2_SIZE                       equ 0001h
CLC2SEL2_D3S2_LENGTH                     equ 0001h
CLC2SEL2_D3S2_MASK                       equ 0004h
CLC2SEL2_D3S3_POSN                       equ 0003h
CLC2SEL2_D3S3_POSITION                   equ 0003h
CLC2SEL2_D3S3_SIZE                       equ 0001h
CLC2SEL2_D3S3_LENGTH                     equ 0001h
CLC2SEL2_D3S3_MASK                       equ 0008h
CLC2SEL2_D3S4_POSN                       equ 0004h
CLC2SEL2_D3S4_POSITION                   equ 0004h
CLC2SEL2_D3S4_SIZE                       equ 0001h
CLC2SEL2_D3S4_LENGTH                     equ 0001h
CLC2SEL2_D3S4_MASK                       equ 0010h
CLC2SEL2_D3S5_POSN                       equ 0005h
CLC2SEL2_D3S5_POSITION                   equ 0005h
CLC2SEL2_D3S5_SIZE                       equ 0001h
CLC2SEL2_D3S5_LENGTH                     equ 0001h
CLC2SEL2_D3S5_MASK                       equ 0020h
CLC2SEL2_D3S6_POSN                       equ 0006h
CLC2SEL2_D3S6_POSITION                   equ 0006h
CLC2SEL2_D3S6_SIZE                       equ 0001h
CLC2SEL2_D3S6_LENGTH                     equ 0001h
CLC2SEL2_D3S6_MASK                       equ 0040h
CLC2SEL2_D3S7_POSN                       equ 0007h
CLC2SEL2_D3S7_POSITION                   equ 0007h
CLC2SEL2_D3S7_SIZE                       equ 0001h
CLC2SEL2_D3S7_LENGTH                     equ 0001h
CLC2SEL2_D3S7_MASK                       equ 0080h

// Register: CLC2SEL3
#define CLC2SEL3 CLC2SEL3
CLC2SEL3                                 equ 0E1Fh
// bitfield definitions
CLC2SEL3_LC2D4S0_POSN                    equ 0000h
CLC2SEL3_LC2D4S0_POSITION                equ 0000h
CLC2SEL3_LC2D4S0_SIZE                    equ 0001h
CLC2SEL3_LC2D4S0_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S0_MASK                    equ 0001h
CLC2SEL3_LC2D4S1_POSN                    equ 0001h
CLC2SEL3_LC2D4S1_POSITION                equ 0001h
CLC2SEL3_LC2D4S1_SIZE                    equ 0001h
CLC2SEL3_LC2D4S1_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S1_MASK                    equ 0002h
CLC2SEL3_LC2D4S2_POSN                    equ 0002h
CLC2SEL3_LC2D4S2_POSITION                equ 0002h
CLC2SEL3_LC2D4S2_SIZE                    equ 0001h
CLC2SEL3_LC2D4S2_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S2_MASK                    equ 0004h
CLC2SEL3_LC2D4S3_POSN                    equ 0003h
CLC2SEL3_LC2D4S3_POSITION                equ 0003h
CLC2SEL3_LC2D4S3_SIZE                    equ 0001h
CLC2SEL3_LC2D4S3_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S3_MASK                    equ 0008h
CLC2SEL3_LC2D4S4_POSN                    equ 0004h
CLC2SEL3_LC2D4S4_POSITION                equ 0004h
CLC2SEL3_LC2D4S4_SIZE                    equ 0001h
CLC2SEL3_LC2D4S4_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S4_MASK                    equ 0010h
CLC2SEL3_LC2D4S5_POSN                    equ 0005h
CLC2SEL3_LC2D4S5_POSITION                equ 0005h
CLC2SEL3_LC2D4S5_SIZE                    equ 0001h
CLC2SEL3_LC2D4S5_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S5_MASK                    equ 0020h
CLC2SEL3_LC2D4S6_POSN                    equ 0006h
CLC2SEL3_LC2D4S6_POSITION                equ 0006h
CLC2SEL3_LC2D4S6_SIZE                    equ 0001h
CLC2SEL3_LC2D4S6_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S6_MASK                    equ 0040h
CLC2SEL3_LC2D4S7_POSN                    equ 0007h
CLC2SEL3_LC2D4S7_POSITION                equ 0007h
CLC2SEL3_LC2D4S7_SIZE                    equ 0001h
CLC2SEL3_LC2D4S7_LENGTH                  equ 0001h
CLC2SEL3_LC2D4S7_MASK                    equ 0080h
CLC2SEL3_LC2D4S_POSN                     equ 0000h
CLC2SEL3_LC2D4S_POSITION                 equ 0000h
CLC2SEL3_LC2D4S_SIZE                     equ 0008h
CLC2SEL3_LC2D4S_LENGTH                   equ 0008h
CLC2SEL3_LC2D4S_MASK                     equ 00FFh
CLC2SEL3_D4S_POSN                        equ 0000h
CLC2SEL3_D4S_POSITION                    equ 0000h
CLC2SEL3_D4S_SIZE                        equ 0008h
CLC2SEL3_D4S_LENGTH                      equ 0008h
CLC2SEL3_D4S_MASK                        equ 00FFh
CLC2SEL3_D4S0_POSN                       equ 0000h
CLC2SEL3_D4S0_POSITION                   equ 0000h
CLC2SEL3_D4S0_SIZE                       equ 0001h
CLC2SEL3_D4S0_LENGTH                     equ 0001h
CLC2SEL3_D4S0_MASK                       equ 0001h
CLC2SEL3_D4S1_POSN                       equ 0001h
CLC2SEL3_D4S1_POSITION                   equ 0001h
CLC2SEL3_D4S1_SIZE                       equ 0001h
CLC2SEL3_D4S1_LENGTH                     equ 0001h
CLC2SEL3_D4S1_MASK                       equ 0002h
CLC2SEL3_D4S2_POSN                       equ 0002h
CLC2SEL3_D4S2_POSITION                   equ 0002h
CLC2SEL3_D4S2_SIZE                       equ 0001h
CLC2SEL3_D4S2_LENGTH                     equ 0001h
CLC2SEL3_D4S2_MASK                       equ 0004h
CLC2SEL3_D4S3_POSN                       equ 0003h
CLC2SEL3_D4S3_POSITION                   equ 0003h
CLC2SEL3_D4S3_SIZE                       equ 0001h
CLC2SEL3_D4S3_LENGTH                     equ 0001h
CLC2SEL3_D4S3_MASK                       equ 0008h
CLC2SEL3_D4S4_POSN                       equ 0004h
CLC2SEL3_D4S4_POSITION                   equ 0004h
CLC2SEL3_D4S4_SIZE                       equ 0001h
CLC2SEL3_D4S4_LENGTH                     equ 0001h
CLC2SEL3_D4S4_MASK                       equ 0010h
CLC2SEL3_D4S5_POSN                       equ 0005h
CLC2SEL3_D4S5_POSITION                   equ 0005h
CLC2SEL3_D4S5_SIZE                       equ 0001h
CLC2SEL3_D4S5_LENGTH                     equ 0001h
CLC2SEL3_D4S5_MASK                       equ 0020h
CLC2SEL3_D4S6_POSN                       equ 0006h
CLC2SEL3_D4S6_POSITION                   equ 0006h
CLC2SEL3_D4S6_SIZE                       equ 0001h
CLC2SEL3_D4S6_LENGTH                     equ 0001h
CLC2SEL3_D4S6_MASK                       equ 0040h
CLC2SEL3_D4S7_POSN                       equ 0007h
CLC2SEL3_D4S7_POSITION                   equ 0007h
CLC2SEL3_D4S7_SIZE                       equ 0001h
CLC2SEL3_D4S7_LENGTH                     equ 0001h
CLC2SEL3_D4S7_MASK                       equ 0080h

