GopalSaraf/Practicals/PSDL/include/proc/pic16lf18854.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ACC0                             BANKMASK(CRCACCL), 0
#define ACC1                             BANKMASK(CRCACCL), 1
#define ACC10                            BANKMASK(CRCACCH), 2
#define ACC11                            BANKMASK(CRCACCH), 3
#define ACC12                            BANKMASK(CRCACCH), 4
#define ACC13                            BANKMASK(CRCACCH), 5
#define ACC14                            BANKMASK(CRCACCH), 6
#define ACC15                            BANKMASK(CRCACCH), 7
#define ACC2                             BANKMASK(CRCACCL), 2
#define ACC3                             BANKMASK(CRCACCL), 3
#define ACC4                             BANKMASK(CRCACCL), 4
#define ACC5                             BANKMASK(CRCACCL), 5
#define ACC6                             BANKMASK(CRCACCL), 6
#define ACC7                             BANKMASK(CRCACCL), 7
#define ACC8                             BANKMASK(CRCACCH), 0
#define ACC9                             BANKMASK(CRCACCH), 1
#define ACCM                             BANKMASK(CRCCON0), 4
#define ACKDT1                           BANKMASK(SSP1CON2), 5
#define ACKDT2                           BANKMASK(SSP2CON2), 5
#define ACKEN1                           BANKMASK(SSP1CON2), 4
#define ACKEN2                           BANKMASK(SSP2CON2), 4
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6
#define ADACC0                           BANKMASK(ADACCL), 0
#define ADACC1                           BANKMASK(ADACCL), 1
#define ADACC10                          BANKMASK(ADACCH), 2
#define ADACC11                          BANKMASK(ADACCH), 3
#define ADACC12                          BANKMASK(ADACCH), 4
#define ADACC13                          BANKMASK(ADACCH), 5
#define ADACC14                          BANKMASK(ADACCH), 6
#define ADACC15                          BANKMASK(ADACCH), 7
#define ADACC2                           BANKMASK(ADACCL), 2
#define ADACC3                           BANKMASK(ADACCL), 3
#define ADACC4                           BANKMASK(ADACCL), 4
#define ADACC5                           BANKMASK(ADACCL), 5
#define ADACC6                           BANKMASK(ADACCL), 6
#define ADACC7                           BANKMASK(ADACCL), 7
#define ADACC8                           BANKMASK(ADACCH), 0
#define ADACC9                           BANKMASK(ADACCH), 1
#define ADACLR                           BANKMASK(ADCON2), 3
#define ADACQ0                           BANKMASK(ADACQ), 0
#define ADACQ1                           BANKMASK(ADACQ), 1
#define ADACQ2                           BANKMASK(ADACQ), 2
#define ADACQ3                           BANKMASK(ADACQ), 3
#define ADACQ4                           BANKMASK(ADACQ), 4
#define ADACQ5                           BANKMASK(ADACQ), 5
#define ADACQ6                           BANKMASK(ADACQ), 6
#define ADACQ7                           BANKMASK(ADACQ), 7
#define ADACT0                           BANKMASK(ADACT), 0
#define ADACT1                           BANKMASK(ADACT), 1
#define ADACT2                           BANKMASK(ADACT), 2
#define ADACT3                           BANKMASK(ADACT), 3
#define ADACT4                           BANKMASK(ADACT), 4
#define ADAOV                            BANKMASK(ADSTAT), 7
#define ADCACTPPS0                       BANKMASK(ADCACTPPS), 0
#define ADCACTPPS1                       BANKMASK(ADCACTPPS), 1
#define ADCACTPPS2                       BANKMASK(ADCACTPPS), 2
#define ADCACTPPS3                       BANKMASK(ADCACTPPS), 3
#define ADCACTPPS4                       BANKMASK(ADCACTPPS), 4
#define ADCALC0                          BANKMASK(ADCON3), 4
#define ADCALC1                          BANKMASK(ADCON3), 5
#define ADCALC2                          BANKMASK(ADCON3), 6
#define ADCAP0                           BANKMASK(ADCAP), 0
#define ADCAP1                           BANKMASK(ADCAP), 1
#define ADCAP2                           BANKMASK(ADCAP), 2
#define ADCAP3                           BANKMASK(ADCAP), 3
#define ADCAP4                           BANKMASK(ADCAP), 4
#define ADCCS0                           BANKMASK(ADCLK), 0
#define ADCCS1                           BANKMASK(ADCLK), 1
#define ADCCS2                           BANKMASK(ADCLK), 2
#define ADCCS3                           BANKMASK(ADCLK), 3
#define ADCCS4                           BANKMASK(ADCLK), 4
#define ADCCS5                           BANKMASK(ADCLK), 5
#define ADCMD                            BANKMASK(PMD2), 5
#define ADCNT0                           BANKMASK(ADCNT), 0
#define ADCNT1                           BANKMASK(ADCNT), 1
#define ADCNT2                           BANKMASK(ADCNT), 2
#define ADCNT3                           BANKMASK(ADCNT), 3
#define ADCNT4                           BANKMASK(ADCNT), 4
#define ADCNT5                           BANKMASK(ADCNT), 5
#define ADCNT6                           BANKMASK(ADCNT), 6
#define ADCNT7                           BANKMASK(ADCNT), 7
#define ADCONT                           BANKMASK(ADCON0), 6
#define ADCRS0                           BANKMASK(ADCON2), 4
#define ADCRS1                           BANKMASK(ADCON2), 5
#define ADCRS2                           BANKMASK(ADCON2), 6
#define ADCS                             BANKMASK(ADCON0), 4
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADDSEN                           BANKMASK(ADCON1), 0
#define ADERR0                           BANKMASK(ADERRL), 0
#define ADERR1                           BANKMASK(ADERRL), 1
#define ADERR10                          BANKMASK(ADERRH), 2
#define ADERR11                          BANKMASK(ADERRH), 3
#define ADERR12                          BANKMASK(ADERRH), 4
#define ADERR13                          BANKMASK(ADERRH), 5
#define ADERR14                          BANKMASK(ADERRH), 6
#define ADERR15                          BANKMASK(ADERRH), 7
#define ADERR2                           BANKMASK(ADERRL), 2
#define ADERR3                           BANKMASK(ADERRL), 3
#define ADERR4                           BANKMASK(ADERRL), 4
#define ADERR5                           BANKMASK(ADERRL), 5
#define ADERR6                           BANKMASK(ADERRL), 6
#define ADERR7                           BANKMASK(ADERRL), 7
#define ADERR8                           BANKMASK(ADERRH), 0
#define ADERR9                           BANKMASK(ADERRH), 1
#define ADFLTR0                          BANKMASK(ADFLTRL), 0
#define ADFLTR1                          BANKMASK(ADFLTRL), 1
#define ADFLTR10                         BANKMASK(ADFLTRH), 2
#define ADFLTR11                         BANKMASK(ADFLTRH), 3
#define ADFLTR12                         BANKMASK(ADFLTRH), 4
#define ADFLTR13                         BANKMASK(ADFLTRH), 5
#define ADFLTR14                         BANKMASK(ADFLTRH), 6
#define ADFLTR15                         BANKMASK(ADFLTRH), 7
#define ADFLTR2                          BANKMASK(ADFLTRL), 2
#define ADFLTR3                          BANKMASK(ADFLTRL), 3
#define ADFLTR4                          BANKMASK(ADFLTRL), 4
#define ADFLTR5                          BANKMASK(ADFLTRL), 5
#define ADFLTR6                          BANKMASK(ADFLTRL), 6
#define ADFLTR7                          BANKMASK(ADFLTRL), 7
#define ADFLTR8                          BANKMASK(ADFLTRH), 0
#define ADFLTR9                          BANKMASK(ADFLTRH), 1
#define ADFM0                            BANKMASK(ADCON0), 2
#define ADFM1                            BANKMASK(ADCON0), 3
#define ADFRM0                           BANKMASK(ADCON0), 2
#define ADFRM1                           BANKMASK(ADCON0), 3
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 0
#define ADGPOL                           BANKMASK(ADCON1), 5
#define ADIE                             BANKMASK(PIE1), 0
#define ADIF                             BANKMASK(PIR1), 0
#define ADIPEN                           BANKMASK(ADCON1), 6
#define ADLTH0                           BANKMASK(ADLTHL), 0
#define ADLTH1                           BANKMASK(ADLTHL), 1
#define ADLTH10                          BANKMASK(ADLTHH), 2
#define ADLTH11                          BANKMASK(ADLTHH), 3
#define ADLTH12                          BANKMASK(ADLTHH), 4
#define ADLTH13                          BANKMASK(ADLTHH), 5
#define ADLTH14                          BANKMASK(ADLTHH), 6
#define ADLTH15                          BANKMASK(ADLTHH), 7
#define ADLTH2                           BANKMASK(ADLTHL), 2
#define ADLTH3                           BANKMASK(ADLTHL), 3
#define ADLTH4                           BANKMASK(ADLTHL), 4
#define ADLTH5                           BANKMASK(ADLTHL), 5
#define ADLTH6                           BANKMASK(ADLTHL), 6
#define ADLTH7                           BANKMASK(ADLTHL), 7
#define ADLTH8                           BANKMASK(ADLTHH), 0
#define ADLTH9                           BANKMASK(ADLTHH), 1
#define ADLTHR                           BANKMASK(ADSTAT), 5
#define ADMACT                           BANKMASK(ADSTAT), 3
#define ADMATH                           BANKMASK(ADSTAT), 4
#define ADMD0                            BANKMASK(ADCON2), 0
#define ADMD1                            BANKMASK(ADCON2), 1
#define ADMD2                            BANKMASK(ADCON2), 2
#define ADMSK11                          BANKMASK(SSP1CON2), 1
#define ADMSK12                          BANKMASK(SSP2CON2), 1
#define ADMSK21                          BANKMASK(SSP1CON2), 2
#define ADMSK22                          BANKMASK(SSP2CON2), 2
#define ADMSK31                          BANKMASK(SSP1CON2), 3
#define ADMSK32                          BANKMASK(SSP2CON2), 3
#define ADMSK41                          BANKMASK(SSP1CON2), 4
#define ADMSK42                          BANKMASK(SSP2CON2), 4
#define ADMSK51                          BANKMASK(SSP1CON2), 5
#define ADMSK52                          BANKMASK(SSP2CON2), 5
#define ADNREF                           BANKMASK(ADREF), 4
#define ADOEN                            BANKMASK(OSCEN), 2
#define ADON                             BANKMASK(ADCON0), 7
#define ADOR                             BANKMASK(OSCSTAT), 2
#define ADPCH0                           BANKMASK(ADPCH), 0
#define ADPCH1                           BANKMASK(ADPCH), 1
#define ADPCH2                           BANKMASK(ADPCH), 2
#define ADPCH3                           BANKMASK(ADPCH), 3
#define ADPCH4                           BANKMASK(ADPCH), 4
#define ADPCH5                           BANKMASK(ADPCH), 5
#define ADPPOL                           BANKMASK(ADCON1), 7
#define ADPRE0                           BANKMASK(ADPRE), 0
#define ADPRE1                           BANKMASK(ADPRE), 1
#define ADPRE2                           BANKMASK(ADPRE), 2
#define ADPRE3                           BANKMASK(ADPRE), 3
#define ADPRE4                           BANKMASK(ADPRE), 4
#define ADPRE5                           BANKMASK(ADPRE), 5
#define ADPRE6                           BANKMASK(ADPRE), 6
#define ADPRE7                           BANKMASK(ADPRE), 7
#define ADPREF0                          BANKMASK(ADREF), 0
#define ADPREF1                          BANKMASK(ADREF), 1
#define ADPREV0                          BANKMASK(ADPREVL), 0
#define ADPREV1                          BANKMASK(ADPREVL), 1
#define ADPREV10                         BANKMASK(ADPREVH), 2
#define ADPREV11                         BANKMASK(ADPREVH), 3
#define ADPREV12                         BANKMASK(ADPREVH), 4
#define ADPREV13                         BANKMASK(ADPREVH), 5
#define ADPREV14                         BANKMASK(ADPREVH), 6
#define ADPREV15                         BANKMASK(ADPREVH), 7
#define ADPREV2                          BANKMASK(ADPREVL), 2
#define ADPREV3                          BANKMASK(ADPREVL), 3
#define ADPREV4                          BANKMASK(ADPREVL), 4
#define ADPREV5                          BANKMASK(ADPREVL), 5
#define ADPREV6                          BANKMASK(ADPREVL), 6
#define ADPREV7                          BANKMASK(ADPREVL), 7
#define ADPREV8                          BANKMASK(ADPREVH), 0
#define ADPREV9                          BANKMASK(ADPREVH), 1
#define ADPSIS                           BANKMASK(ADCON2), 7
#define ADRPT0                           BANKMASK(ADRPT), 0
#define ADRPT1                           BANKMASK(ADRPT), 1
#define ADRPT2                           BANKMASK(ADRPT), 2
#define ADRPT3                           BANKMASK(ADRPT), 3
#define ADRPT4                           BANKMASK(ADRPT), 4
#define ADRPT5                           BANKMASK(ADRPT), 5
#define ADRPT6                           BANKMASK(ADRPT), 6
#define ADRPT7                           BANKMASK(ADRPT), 7
#define ADSOI                            BANKMASK(ADCON3), 3
#define ADSTAT0                          BANKMASK(ADSTAT), 0
#define ADSTAT1                          BANKMASK(ADSTAT), 1
#define ADSTAT2                          BANKMASK(ADSTAT), 2
#define ADSTPT0                          BANKMASK(ADSTPTL), 0
#define ADSTPT1                          BANKMASK(ADSTPTL), 1
#define ADSTPT10                         BANKMASK(ADSTPTH), 2
#define ADSTPT11                         BANKMASK(ADSTPTH), 3
#define ADSTPT12                         BANKMASK(ADSTPTH), 4
#define ADSTPT13                         BANKMASK(ADSTPTH), 5
#define ADSTPT14                         BANKMASK(ADSTPTH), 6
#define ADSTPT15                         BANKMASK(ADSTPTH), 7
#define ADSTPT2                          BANKMASK(ADSTPTL), 2
#define ADSTPT3                          BANKMASK(ADSTPTL), 3
#define ADSTPT4                          BANKMASK(ADSTPTL), 4
#define ADSTPT5                          BANKMASK(ADSTPTL), 5
#define ADSTPT6                          BANKMASK(ADSTPTL), 6
#define ADSTPT7                          BANKMASK(ADSTPTL), 7
#define ADSTPT8                          BANKMASK(ADSTPTH), 0
#define ADSTPT9                          BANKMASK(ADSTPTH), 1
#define ADTIE                            BANKMASK(PIE1), 1
#define ADTIF                            BANKMASK(PIR1), 1
#define ADTMD0                           BANKMASK(ADCON3), 0
#define ADTMD1                           BANKMASK(ADCON3), 1
#define ADTMD2                           BANKMASK(ADCON3), 2
#define ADUTH0                           BANKMASK(ADUTHL), 0
#define ADUTH1                           BANKMASK(ADUTHL), 1
#define ADUTH10                          BANKMASK(ADUTHH), 2
#define ADUTH11                          BANKMASK(ADUTHH), 3
#define ADUTH12                          BANKMASK(ADUTHH), 4
#define ADUTH13                          BANKMASK(ADUTHH), 5
#define ADUTH14                          BANKMASK(ADUTHH), 6
#define ADUTH15                          BANKMASK(ADUTHH), 7
#define ADUTH2                           BANKMASK(ADUTHL), 2
#define ADUTH3                           BANKMASK(ADUTHL), 3
#define ADUTH4                           BANKMASK(ADUTHL), 4
#define ADUTH5                           BANKMASK(ADUTHL), 5
#define ADUTH6                           BANKMASK(ADUTHL), 6
#define ADUTH7                           BANKMASK(ADUTHL), 7
#define ADUTH8                           BANKMASK(ADUTHH), 0
#define ADUTH9                           BANKMASK(ADUTHH), 1
#define ADUTHR                           BANKMASK(ADSTAT), 6
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA3                            BANKMASK(ANSELA), 3
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define ANSA6                            BANKMASK(ANSELA), 6
#define ANSA7                            BANKMASK(ANSELA), 7
#define ANSB0                            BANKMASK(ANSELB), 0
#define ANSB1                            BANKMASK(ANSELB), 1
#define ANSB2                            BANKMASK(ANSELB), 2
#define ANSB3                            BANKMASK(ANSELB), 3
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC4                            BANKMASK(ANSELC), 4
#define ANSC5                            BANKMASK(ANSELC), 5
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define BCL1IE                           BANKMASK(PIE3), 1
#define BCL1IF                           BANKMASK(PIR3), 1
#define BCL2IE                           BANKMASK(PIE3), 3
#define BCL2IF                           BANKMASK(PIR3), 3
#define BF1                              BANKMASK(SSP1STAT), 0
#define BF2                              BANKMASK(SSP2STAT), 0
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 0
#define C1IF                             BANKMASK(PIR2), 0
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NSEL), 0
#define C1NCH1                           BANKMASK(CM1NSEL), 1
#define C1NCH2                           BANKMASK(CM1NSEL), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1PCH0                           BANKMASK(CM1PSEL), 0
#define C1PCH1                           BANKMASK(CM1PSEL), 1
#define C1PCH2                           BANKMASK(CM1PSEL), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 1
#define C2IF                             BANKMASK(PIR2), 1
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NSEL), 0
#define C2NCH1                           BANKMASK(CM2NSEL), 1
#define C2NCH2                           BANKMASK(CM2NSEL), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2PCH0                           BANKMASK(CM2PSEL), 0
#define C2PCH1                           BANKMASK(CM2PSEL), 1
#define C2PCH2                           BANKMASK(CM2PSEL), 2
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5
#define C4TSEL0                          BANKMASK(CCPTMRS0), 6
#define C4TSEL1                          BANKMASK(CCPTMRS0), 7
#define C5TSEL0                          BANKMASK(CCPTMRS1), 0
#define C5TSEL1                          BANKMASK(CCPTMRS1), 1
#define CAL01                            BANKMASK(TMR1L), 0
#define CAL03                            BANKMASK(TMR3L), 0
#define CAL05                            BANKMASK(TMR5L), 0
#define CAL11                            BANKMASK(TMR1L), 1
#define CAL13                            BANKMASK(TMR3L), 1
#define CAL15                            BANKMASK(TMR5L), 1
#define CAL21                            BANKMASK(TMR1L), 2
#define CAL23                            BANKMASK(TMR3L), 2
#define CAL25                            BANKMASK(TMR5L), 2
#define CAL31                            BANKMASK(TMR1L), 3
#define CAL33                            BANKMASK(TMR3L), 3
#define CAL35                            BANKMASK(TMR5L), 3
#define CAL41                            BANKMASK(TMR1L), 4
#define CAL43                            BANKMASK(TMR3L), 4
#define CAL45                            BANKMASK(TMR5L), 4
#define CAL51                            BANKMASK(TMR1L), 5
#define CAL53                            BANKMASK(TMR3L), 5
#define CAL55                            BANKMASK(TMR5L), 5
#define CAL61                            BANKMASK(TMR1L), 6
#define CAL63                            BANKMASK(TMR3L), 6
#define CAL65                            BANKMASK(TMR5L), 6
#define CAL71                            BANKMASK(TMR1L), 7
#define CAL73                            BANKMASK(TMR3L), 7
#define CAL75                            BANKMASK(TMR5L), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CCDEN                            BANKMASK(CCDCON), 7
#define CCDNA0                           BANKMASK(CCDNA), 0
#define CCDNA1                           BANKMASK(CCDNA), 1
#define CCDNA2                           BANKMASK(CCDNA), 2
#define CCDNA3                           BANKMASK(CCDNA), 3
#define CCDNA4                           BANKMASK(CCDNA), 4
#define CCDNA5                           BANKMASK(CCDNA), 5
#define CCDNA6                           BANKMASK(CCDNA), 6
#define CCDNA7                           BANKMASK(CCDNA), 7
#define CCDNB0                           BANKMASK(CCDNB), 0
#define CCDNB1                           BANKMASK(CCDNB), 1
#define CCDNB2                           BANKMASK(CCDNB), 2
#define CCDNB3                           BANKMASK(CCDNB), 3
#define CCDNB4                           BANKMASK(CCDNB), 4
#define CCDNB5                           BANKMASK(CCDNB), 5
#define CCDNB6                           BANKMASK(CCDNB), 6
#define CCDNB7                           BANKMASK(CCDNB), 7
#define CCDNC0                           BANKMASK(CCDNC), 0
#define CCDNC1                           BANKMASK(CCDNC), 1
#define CCDNC2                           BANKMASK(CCDNC), 2
#define CCDNC3                           BANKMASK(CCDNC), 3
